zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DMA_TCD_0.h
  __IO uint32_t TCD27_DADDR;                       /**< TCD Destination Address, offset: 0x23C030 */
  __IO uint16_t TCD27_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x23C034 */
  union {                                          /* offset: 0x23C036 */
    __IO uint16_t TCD27_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23C036 */
    __IO uint16_t TCD27_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23C036 */
  } CITER27;
  __IO uint32_t TCD27_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x23C038 */
  __IO uint16_t TCD27_CSR;                         /**< TCD Control and Status, offset: 0x23C03C */
  union {                                          /* offset: 0x23C03E */
    __IO uint16_t TCD27_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23C03E */
    __IO uint16_t TCD27_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23C03E */
  } BITER27;
  uint8_t RESERVED_55[16320];
  __IO uint32_t CH28_CSR;                          /**< Channel Control and Status, offset: 0x240000 */
  __IO uint32_t CH28_ES;                           /**< Channel Error Status, offset: 0x240004 */
  __IO uint32_t CH28_INT;                          /**< Channel Interrupt Status, offset: 0x240008 */
  __IO uint32_t CH28_SBR;                          /**< Channel System Bus, offset: 0x24000C */
  __IO uint32_t CH28_PRI;                          /**< Channel Priority, offset: 0x240010 */
  uint8_t RESERVED_56[12];
  __IO uint32_t TCD28_SADDR;                       /**< TCD Source Address, offset: 0x240020 */
  __IO uint16_t TCD28_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x240024 */
  __IO uint16_t TCD28_ATTR;                        /**< TCD Transfer Attributes, offset: 0x240026 */
  union {                                          /* offset: 0x240028 */
    __IO uint32_t TCD28_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x240028 */
    __IO uint32_t TCD28_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x240028 */
  } NBYTES28;
  __IO uint32_t TCD28_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x24002C */
  __IO uint32_t TCD28_DADDR;                       /**< TCD Destination Address, offset: 0x240030 */
  __IO uint16_t TCD28_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x240034 */
  union {                                          /* offset: 0x240036 */
    __IO uint16_t TCD28_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x240036 */
    __IO uint16_t TCD28_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x240036 */
  } CITER28;
  __IO uint32_t TCD28_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x240038 */
  __IO uint16_t TCD28_CSR;                         /**< TCD Control and Status, offset: 0x24003C */
  union {                                          /* offset: 0x24003E */
    __IO uint16_t TCD28_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24003E */
    __IO uint16_t TCD28_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24003E */
  } BITER28;
  uint8_t RESERVED_57[16320];
  __IO uint32_t CH29_CSR;                          /**< Channel Control and Status, offset: 0x244000 */
  __IO uint32_t CH29_ES;                           /**< Channel Error Status, offset: 0x244004 */
  __IO uint32_t CH29_INT;                          /**< Channel Interrupt Status, offset: 0x244008 */
  __IO uint32_t CH29_SBR;                          /**< Channel System Bus, offset: 0x24400C */
  __IO uint32_t CH29_PRI;                          /**< Channel Priority, offset: 0x244010 */
  uint8_t RESERVED_58[12];
  __IO uint32_t TCD29_SADDR;                       /**< TCD Source Address, offset: 0x244020 */
  __IO uint16_t TCD29_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x244024 */
  __IO uint16_t TCD29_ATTR;                        /**< TCD Transfer Attributes, offset: 0x244026 */
  union {                                          /* offset: 0x244028 */
    __IO uint32_t TCD29_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x244028 */
    __IO uint32_t TCD29_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x244028 */
  } NBYTES29;
  __IO uint32_t TCD29_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x24402C */
  __IO uint32_t TCD29_DADDR;                       /**< TCD Destination Address, offset: 0x244030 */
  __IO uint16_t TCD29_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x244034 */
  union {                                          /* offset: 0x244036 */
    __IO uint16_t TCD29_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x244036 */
    __IO uint16_t TCD29_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x244036 */
  } CITER29;
  __IO uint32_t TCD29_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x244038 */
  __IO uint16_t TCD29_CSR;                         /**< TCD Control and Status, offset: 0x24403C */
  union {                                          /* offset: 0x24403E */
    __IO uint16_t TCD29_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24403E */
    __IO uint16_t TCD29_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24403E */
  } BITER29;
  uint8_t RESERVED_59[16320];
  __IO uint32_t CH30_CSR;                          /**< Channel Control and Status, offset: 0x248000 */
  __IO uint32_t CH30_ES;                           /**< Channel Error Status, offset: 0x248004 */
  __IO uint32_t CH30_INT;                          /**< Channel Interrupt Status, offset: 0x248008 */
  __IO uint32_t CH30_SBR;                          /**< Channel System Bus, offset: 0x24800C */
  __IO uint32_t CH30_PRI;                          /**< Channel Priority, offset: 0x248010 */
  uint8_t RESERVED_60[12];
  __IO uint32_t TCD30_SADDR;                       /**< TCD Source Address, offset: 0x248020 */
  __IO uint16_t TCD30_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x248024 */
  __IO uint16_t TCD30_ATTR;                        /**< TCD Transfer Attributes, offset: 0x248026 */
  union {                                          /* offset: 0x248028 */
    __IO uint32_t TCD30_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x248028 */
    __IO uint32_t TCD30_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x248028 */
  } NBYTES30;
  __IO uint32_t TCD30_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x24802C */
  __IO uint32_t TCD30_DADDR;                       /**< TCD Destination Address, offset: 0x248030 */
  __IO uint16_t TCD30_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x248034 */
  union {                                          /* offset: 0x248036 */
    __IO uint16_t TCD30_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x248036 */
    __IO uint16_t TCD30_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x248036 */
  } CITER30;
  __IO uint32_t TCD30_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x248038 */
  __IO uint16_t TCD30_CSR;                         /**< TCD Control and Status, offset: 0x24803C */
  union {                                          /* offset: 0x24803E */
    __IO uint16_t TCD30_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24803E */
    __IO uint16_t TCD30_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24803E */
  } BITER30;
  uint8_t RESERVED_61[16320];
  __IO uint32_t CH31_CSR;                          /**< Channel Control and Status, offset: 0x24C000 */
  __IO uint32_t CH31_ES;                           /**< Channel Error Status, offset: 0x24C004 */
  __IO uint32_t CH31_INT;                          /**< Channel Interrupt Status, offset: 0x24C008 */
  __IO uint32_t CH31_SBR;                          /**< Channel System Bus, offset: 0x24C00C */
  __IO uint32_t CH31_PRI;                          /**< Channel Priority, offset: 0x24C010 */
  uint8_t RESERVED_62[12];
  __IO uint32_t TCD31_SADDR;                       /**< TCD Source Address, offset: 0x24C020 */
  __IO uint16_t TCD31_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x24C024 */
  __IO uint16_t TCD31_ATTR;                        /**< TCD Transfer Attributes, offset: 0x24C026 */
  union {                                          /* offset: 0x24C028 */
    __IO uint32_t TCD31_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x24C028 */
    __IO uint32_t TCD31_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x24C028 */
  } NBYTES31;
  __IO uint32_t TCD31_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x24C02C */
  __IO uint32_t TCD31_DADDR;                       /**< TCD Destination Address, offset: 0x24C030 */
  __IO uint16_t TCD31_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x24C034 */
  union {                                          /* offset: 0x24C036 */
    __IO uint16_t TCD31_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24C036 */
    __IO uint16_t TCD31_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24C036 */
  } CITER31;
  __IO uint32_t TCD31_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x24C038 */
  __IO uint16_t TCD31_CSR;                         /**< TCD Control and Status, offset: 0x24C03C */
  union {                                          /* offset: 0x24C03E */
    __IO uint16_t TCD31_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x24C03E */
    __IO uint16_t TCD31_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x24C03E */
  } BITER31;
} TCD_0_Type, *TCD_0_MemMapPtr;

/** Number of instances of the TCD_0 module. */
#define TCD_0_INSTANCE_COUNT                     (1u)

/* TCD_0 - Peripheral instance base addresses */
/** Peripheral TCD_0 base address */
#define IP_TCD_0_BASE                            (0x40210000u)
/** Peripheral TCD_0 base pointer */
#define IP_TCD_0                                 ((TCD_0_Type *)IP_TCD_0_BASE)
/** Array initializer of TCD_0 peripheral base addresses */
#define IP_TCD_0_BASE_ADDRS                      { IP_TCD_0_BASE }
/** Array initializer of TCD_0 peripheral base pointers */
#define IP_TCD_0_BASE_PTRS                       { IP_TCD_0 }

/* ----------------------------------------------------------------------------
   -- TCD_0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TCD_0_Register_Masks TCD_0 Register Masks
 * @{
 */

/*! @name CH0_CSR - Channel Control and Status */
/*! @{ */

#define TCD_0_CH0_CSR_ERQ_MASK                   (0x1U)
#define TCD_0_CH0_CSR_ERQ_SHIFT                  (0U)
#define TCD_0_CH0_CSR_ERQ_WIDTH                  (1U)
#define TCD_0_CH0_CSR_ERQ(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_0_CH0_CSR_ERQ_SHIFT)) & TCD_0_CH0_CSR_ERQ_MASK)

